Revit 2027 API
Schema.VendorId Property
 The id of the third-party vendor that may access entities of this Schema under the Vendor access level.
Namespace: Autodesk.Revit.DB.ExtensibleStorage
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string VendorId { get; }
Public ReadOnly Property VendorId As String
	Get
public:
property String^ VendorId {
	String^ get ();
}
member VendorId : string with get
Property Value
String
See Also
Reference
Schema Class
Autodesk.Revit.DB.ExtensibleStorage Namespace